#language: ru

  @test
  Функционал: Написание комментария в случайной теме

    Сценарий: тест

      И Открываем страницу "Главная страница"
      И На странице "Главная страница" нажимаем на кнопку "Войти"
      И На странице "Главная страница" вводим логин "Логин" "Olga"
      И На странице "Главная страница" пароль "Пароль" "wuhnyq-gojfex-ronhE8"
      И На странице "Главная страница" авторизуемся "Авторизация"
      И На странице "Главная страница" проверяем "Успешность авторизации"
      И На странице "Главная страница" выбираем случайную тему "Случайная тема"
      И На странице "Главная страница" нажимаем на кнопку "Подписаться"
      И На странице "Главная страница" выбираем случайную тему "Случайная тема"
      И На странице "Главная страница" нажимаем на кнопку "Подписаться"
      И На странице "Главная страница" переходим на вкладку "Подписки"
      И На странице "Главная страница" проверяем "Подписка на тему"
      И На странице "Главная страница" нажимаем на кнопку "Отписаться"
      И На странице "Главная страница" проверяем "Подписка на тему"
      И На странице "Главная страница" нажимаем на кнопку "Отписаться"