#language: ru

  @test
  Функционал: Написание комментария в случайной теме

    Сценарий: тест

      И Открываем страницу "Главная страница"
      И На странице "Главная страница" нажимаем на кнопку "Войти", вводим логин "Логин" "Olga" и пароль "Пароль" "wuhnyq-gojfex-ronhE8", авторизуемся "Авторизация"
      И На странице "Главная страница" проверяем успешность авторизации "Проверка авторизации"
      И На странице "Главная страница" выбираем случайную тему "Тема"
      И На странице "Случайная тема" нажимаем на кнопку "Ответить"
      И На странице "Случайная тема" в поле "Текст" вводим "Очередной интересный комментарий", нажимаем на кнопку "Отправить ответ"
      И Проверяем отображение сообщения "Очередной интересный комментарий" на странице "Случайная тема"
      И Переходим на вкладку "Темы" на странице "Главная страница"
      И На странице "Главная страница" выбираем случайную тему "Тема"
      И На странице "Случайная тема" нажимаем на кнопку "Ответить"
      И На странице "Случайная тема" в поле "Текст" вводим "Очередной интересный комментарий", нажимаем на кнопку "Отправить ответ"
      И Проверяем отображение сообщения "Очередной интересный комментарий" на странице "Случайная тема"
      И Переходим на вкладку "Темы" на странице "Главная страница"